0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    my-velocity-inlet
    {
        type            calculated;
        value           uniform 0;
    }

    my-pressure-outlet
    {
        type            calculated;
        value           uniform 0;
    }

    my-wall
    {
        type            nutkWallFunction;
        value           uniform 0; 
    }

    "(frontLeftPlane|frontRightPlane|frontBump|backLeftPlane|backRightPlane|backBump)"
    {
        type            cyclic;
    }

    freeSurf
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
